musicstudio/src/Documents/Занятие/Занятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Занятие</name>
  <registerRecords>InformationRegister.РасписаниеЗанятий</registerRecords>
  <registerRecords>AccumulationRegister.БалансАбонементов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

musicstudio/src/AccumulationRegisters/БалансАбонементов/БалансАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БалансАбонементов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.Абонемент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

musicstudio/src/InformationRegisters/РасписаниеЗанятий/РасписаниеЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеЗанятий</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

musicstudio/src/Documents/Занятие/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр БалансАбонементов
	Движения.БалансАбонементов.Записывать = Истина;
	Движение = Движения.БалансАбонементов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Абонемент = Абонемент;
	Движение.Остаток = Продолжительность;

	// регистр РасписаниеЗанятий
	Движения.РасписаниеЗанятий.Записывать = Истина;
	Движение = Движения.РасписаниеЗанятий.Добавить();
	Движение.Филиал = Филиал;
	Движение.Аудитория = Аудитория;
	Движение.Сотрудник = Сотрудник;
	Движение.ВремяНачала = ВремяНачала;
	Движение.ВремяОкончания = ВремяОкончания;

	КонецПроцедуры
